/*
练习：
1、按实际运算步骤，打印出 ((13 << 2) | 4) ^ 15 每步的结果。
2、按实际运算步骤，打印出 ~(14 | 7) & 9 每步的结果。
打印格式：
第一步结果为...
第二步结果为...
...
第n步结果为...
*/
#include <stdio.h>

int main()
{
    // 1、按实际运算步骤，打印出 ((13 << 2) | 4) ^ 15 每步的结果。
    printf("第一步结果为%d\n", 13 << 2);
    printf("第二步结果为%d\n", (13 << 2) | 4);
    printf("第三步结果为%d\n", ((13 << 2) | 4) ^ 15);
    // 2、按实际运算步骤，打印出 ~(14 | 7) & 9 每步的结果。
    printf("第一步结果为%d\n", 14 | 7);
    printf("第二步结果为%d\n", ~(14 | 7));
    printf("第三步结果为%d\n", ~(14 | 7) & 9);
    return 0;
}