#include <stdio.h>

int main() {
    /*
    练习1：
    1、定义两个int类型变量a和b，初始值分别设为2和3。
    2、将以下语句换成用复合运算符的形式，并打印出a的值。
    1）a = a + 3; // 执行后a的值为5
    2）a = a * b; // 执行后a的值为15
    3）a = a / (b + 2); // 执行后a的值为3
    打印格式：a = ...
    */
    int a = 2;
    int b = 3;

    a += 3;
    printf("a = %d\n", a);
    a *= b;
    printf("a = %d\n", a);
    a /= b + 2;
    printf("a = %d\n", a);   
    
    /*
    练习2：
    1、定义两个int类型变量c和d，分别赋初始值为3和5。
    2、利用复合运算符和自增自减运算符，使得c和自增的d相乘后，c变为15，d变为6，打印出结果。
    3、利用复合运算符和自增自减运算符，使得d和自减的c相加后，d变为20，c变为14，打印出结果。

    打印格式：c = ..., d = ...
    */
    int c = 3;
    int d = 5;

    c *= d++;
    printf("c = %d, d = %d\n", c, d);
    d += --c;
    printf("c = %d, d = %d\n", c, d);
}

